Revit 2027 API
BuiltInFailures.SketchFailures.LoopIntersectPath3d Property
 Lines cannot intersect each other. The highlighted lines currently intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoopIntersectPath3d { get; }
Public Shared ReadOnly Property LoopIntersectPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoopIntersectPath3d {
	FailureDefinitionId^ get ();
}
static member LoopIntersectPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace